app/controllers/api/v1/reservations_controller.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1  [["user_id", 6]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def index
    @reservations = User.find(params[:user_id]).reservations.map do |reservation|

INSERT INTO "reservations" ("user_id", "car_id", "created_at", "updated_at", "city") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 6], ["car_id", 4], ["created_at", "2022-05-13 19:30:55.811790"], ["updated_at", "2022-05-13 19:30:55.811790"], ["city", "Chicago"]]
---
  def create
    @reservation = Reservation.new(reservation_params)

    if @reservation.save