app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "admin", "created_at", "updated_at", "email", "password") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def token_authenticate
    token = request.headers['Authenticate']
    user = User.find(decode(token)['user_id'])